ИС_СПОРТ_2022/src/DataProcessors/МастерЗаполненияУчебногоГода/МастерЗаполненияУчебногоГода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МастерЗаполненияУчебногоГода</name>
</mdclass:DataProcessor>

ИС_СПОРТ_2022/src/InformationRegisters/СоставУчащихсяСпортивногоУчреждения/СоставУчащихсяСпортивногоУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставУчащихсяСпортивногоУчреждения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпортаУдалить</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/DataProcessors/МастерЗаполненияУчебногоГода/ManagerModule.bsl
Функция ПолучитьТаблицуНеучтенныхСпортсменов(УчебныйГод, ВидСпорта, ВозрастнаяГруппа) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	Спортсмены.Ссылка КАК Спортсмен
	                |ПОМЕСТИТЬ ВТ_РазрешенныеСпортсмены
	                |ИЗ
	                |	Справочник.Спортсмены КАК Спортсмены
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	                |		ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	                |ГДЕ
	                |	ГОД(ФизическиеЛица.ДатаРождения) >= &ГодРожденияОт
	                |	И ГОД(ФизическиеЛица.ДатаРождения) <= &ГодРожденияДо
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СоставУчащихся.Спортсмен КАК Спортсмен
	                |ИЗ
	                |	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(
	                |			&Дата,
	                |			Спортсмен В
	                |					(ВЫБРАТЬ
	                |						ВТ_РазрешенныеСпортсмены.Спортсмен
	                |					ИЗ
	                |						ВТ_РазрешенныеСпортсмены)
	                |				И ВидСпорта = &ВидСпорта) КАК СоставУчащихся";
	 Запрос.УстановитьПараметр("ГодРожденияОт", Год(УчебныйГод.ДатаНачала) - ВозрастнаяГруппа.ВозрастДо);
	 Запрос.УстановитьПараметр("ГодРожденияДо", Год(УчебныйГод.ДатаНачала) - ВозрастнаяГруппа.ВозрастОт);
	 Запрос.УстановитьПараметр("ВидСпорта"    , ВидСпорта);
	 Запрос.УстановитьПараметр("Дата"         , УчебныйГод.ДатаОкончания);
	
	 Возврат Запрос.Выполнить().Выгрузить();
	 
 КонецФункции
